[
  {
    "term": "return on equity",
    "definition": "Return on equity (ROE) is a measure of a company's financial performance. It is calculated by dividingnet incomeby shareholders' equity. Because shareholders' equity is equal to a company’s assets minus its debt, ROE is a way of showing a company'sreturn on net assets.",
    "url": "https://www.investopedia.com/terms/r/returnonequity.asp"
  },
  {
    "term": "dividend yield",
    "definition": "A stock's dividend yield is a ratio showing how much a company pays out in dividends each year relative to its stock price. The reciprocal of the dividend yield is the dividend payout ratio.",
    "url": "https://www.investopedia.com/terms/d/dividendyield.asp"
  },
  {
    "term": "bear market",
    "definition": "A bear market is a market condition where investors are more risk-averse than risk-seeking, defined by some as when prices have fallen more than 20% from previous highs.",
    "url": "https://www.investopedia.com/terms/b/bearmarket.asp"
  },
  {
    "term": "liquidity",
    "definition": "Liquidity refers to the efficiency or ease with which anassetorsecuritycan be converted into ready cash without affecting its market price. The most liquid asset of all is cash itself. Consequently, the availability of cash to make such conversions is the biggest influence on whether a market can move efficiently.",
    "url": "https://www.investopedia.com/terms/l/liquidity.asp"
  },
  {
    "term": "dividend",
    "definition": "Dividends are a percentage of a company's earnings paid to its shareholders as their share of the profits. Dividends are generally paid quarterly, with the amount decided by the board of directors based on the company's most recent earnings.",
    "url": "https://www.investopedia.com/terms/d/dividend.asp"
  },
  {
    "term": "return",
    "definition": "A return, also known as a financial return, in its simplest terms, is the money made or lost on aninvestmentover some period of time.",
    "url": "https://www.investopedia.com/terms/r/return.asp"
  },
  {
    "term": "market",
    "definition": "A market is any place or venue where buyers and sellers can exchange goods and services. A market may be physical, like a retail outlet, or virtual, like an online brokerage with no physical contact between buyers and sellers.",
    "url": "https://www.investopedia.com/terms/m/market.asp"
  },
  {
    "term": "equity",
    "definition": "In finance, equity refers to an ownership stake whose value is reduced by an associated debt. For homeowners,home equityrefers to the value of a property, minus the balance of any mortgages or debts.",
    "url": "https://www.investopedia.com/terms/e/equity.asp"
  },
  {
    "term": "yield",
    "definition": "The yield of a stock, bond, or other asset is the earnings generated and realized on an investment over a particular period of time, including the interest it earns or the dividends paid to investors.",
    "url": "https://www.investopedia.com/terms/y/yield.asp"
  },
  {
    "term": "play",
    "definition": "Play is a slang term that describes the investment action that an investor makes. An investor can make a play to invest in certain stocks ormutual funds. \"Playing the stock market\" is a phrase used by beginner investors signifying that they have gained access, simulated or real, to the ups and downs of thestock market. A play can result in being a \"good play\" when the decision turns out positive or a \"poor play\" when the decision turns out negative.",
    "url": "https://www.investopedia.com/terms/p/play.asp"
  },
  {
    "term": "bear",
    "definition": "A bear is a trader or investor who consistently believes the market or a particular stock is headed downwards.",
    "url": "https://www.investopedia.com/terms/b/bear.asp"
  },
  {
    "term": "a",
    "definition": "Stock symbols are a shorthand way of describing a company's stock on an exchange. They're also referred to as ticker symbols. They can include up to five characters. Stocks listed on theNew York Stock Exchange(NYSE) can have four or fewer letters.Nasdaq-listed securities can have up to five characters. There's no significant difference between those that have three letters and those that have four or five.",
    "url": "https://www.investopedia.com/terms/a/a.asp"
  }
]